# PANDAS19 Formatting tampilan Data Frame

## Import modules & Cek Versi

In [5]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.3
1.19.2

## Persiapan Data Frame

In [6]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

   omset  operasional
0      7            6
1      6           13
2     17           18
3     15            5
4      1            9

In [7]:
df['omset'] = df['omset'] * 100_000
df['operasional'] = df['operasional'] * 10_000 #underscore = ignore character
df

     omset  operasional
0   700000        60000
1   600000       130000
2  1700000       180000
3  1500000        50000
4   100000        90000

In [8]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index() #index dibuat jadi index biasa, bukan index date
df = df.rename(columns={'index':'tanggal'})
df

     tanggal    omset  operasional
0 2000-01-01   700000        60000
1 2000-01-02   600000       130000
2 2000-01-03  1700000       180000
3 2000-01-04  1500000        50000
4 2000-01-05   100000        90000

## Melakukan formatting tampilan Data Frame

In [9]:
formatku = {
    'tanggal': '{:%d/%m/%y}',
    'operasional': 'Rp {:.2f}',
    'omset': 'Rp {:.2f}'
}

laporan = df.style.format(formatku)
laporan

In [10]:
type(laporan) #objectnya bukan tipe data frame lagi

pandas.io.formats.style.Styler

In [11]:
laporan.hide_index()

In [12]:
laporan.set_caption('Data Omset dan Operasional')

In [13]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')